; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 218308 1 2 3 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation0 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star7)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(have_image Phenomenon8 spectrograph0)
	(have_image Star9 spectrograph0)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 thermograph2)
	(have_image Planet12 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
2. (turn_to satellite0 groundstation0 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 star9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
5. (turn_to satellite0 planet12 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet12)
   goals met: 0 of 6
6. (take_image satellite0 planet12 instrument1 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 1 of 6
7. (turn_to satellite0 star9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star9)
   goals met: 1 of 6
8. (turn_to satellite0 planet11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet11)
   goals met: 1 of 6
9. (take_image satellite0 planet11 instrument1 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 2 of 6
10. (turn_to satellite0 star9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star9)
   goals met: 2 of 6
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 6
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
13. (turn_to satellite0 groundstation6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation6)
   goals met: 2 of 6
14. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 2 of 6
15. (turn_to satellite0 star9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star9)
   goals met: 2 of 6
16. (take_image satellite0 star9 instrument0 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 3 of 6
17. (turn_to satellite0 phenomenon8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 6
18. (take_image satellite0 phenomenon8 instrument0 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 4 of 6
19. (turn_to satellite0 phenomenon10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 6
20. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 5 of 6
21. (turn_to satellite0 groundstation5 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation5)
   goals met: 6 of 6
